Revit 2024 API
RebarCurvesData.GetNumberOfBarGeometry Method
 Gets the number of Bar Geometry that were added.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public int GetNumberOfBarGeometry()
Visual Basic
Public Function GetNumberOfBarGeometry As Integer
Visual C++
public:
int GetNumberOfBarGeometry()
Return Value
 Returns the number of Bar Geometry that were added.
See Also
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace